{"share_type":"discussion","created":"2014-05-22T23:20:29-07:00","createdBy":"PaladinOne","title":"1.7 Steam","description":"I'm creating this comment thread for all of the math we can figure out about 1.7 Steam Machines and Boilers.  This is based on the code\/math that Reloque posted 3 months ago, and some testing I did tonight, and is a repost of <!-- ws:start:WikiTextUrlRule:16:http:\/\/forum.industrial-craft.net\/index.php?page=Thread&amp;postID=158994#post158994 --><a class=\"wiki_link_ext\" href=\"http:\/\/forum.industrial-craft.net\/index.php?page=Thread&amp;postID=158994#post158994\" rel=\"nofollow\">http:\/\/forum.industrial-craft.net\/index.php?page=Thread&amp;postID=158994#post158994<\/a><!-- ws:end:WikiTextUrlRule:16 --><br \/>\n<br \/>\n<br \/>\n<br \/>\n-The Small Coal Boiler uses the same steam production math as it did on 1.6. (150L Steam \/ 25t = 6L\/t)<br \/>\n-The High Pressure Coal Boiler uses the same production math as it did on 1.6, however I had the math wrong. It actually produces 150L Steam \/ 10 ticks = 15L\/t<br \/>\nThe High Pressure Boilers take ~52 seconds to start producing steam from cold.<br \/>\n-The High Pressure Lava Boiler produces steam twice as fast as the High Pressure Coal Boiler. It produces 300L Steam \/ 10 Ticks = 30L\/t. <br \/>\nOne Lava Bucket increases the Boiler's temperature by 310, over a time of 3 minutes and 20 seconds.<br \/>\n-All Bronze Steam Machines store 16,000L (16 Buckets) of Steam in their internal tanks.<br \/>\n-All Steel (High-Pressure) Steam Machines store 32,000L (32 Buckets) of Steam in their internal tanks. However, bug, the Debug Scanner displays that Tank 0 has a capacity of 16,000. (Should be 32,000)<br \/>\n-Also, possible bug, the Debug Scanner does not show the amount of Water stored in the internal tanks of Boilers.<br \/>\n-All Fluid Pipes store fluid equal to their listed capacity\/second<br \/>\n-The Solar Boiler outputs steam at the same rate as the Small Coal Boiler (150L Steam \/ 25t = 6L\/t). However, for its fuel:<br \/>\n*it checks approximately every 13 seconds if it can see the sun. If it can, it gives itself approximately 5 seconds of fuel. (8 Fuel Ticks) In these 5 seconds, its Heat increases by 8 and decreases by 2, for a total change of +6. During the following 8 seconds, it drops an additional 3 or 4, for a total change of ~+2.75 per 13 seconds of daylight, or about .21 degrees per second. By this math, it takes approximately 6.3 minutes for a cold Boiler to reach working temperatures. (This is also how long you have to get water in it after you place it.  :) )<br \/>\n-When a Boiler reaches maximum Steam capacity (16 or 32 buckets), it releases 25% of its total capacity along with a Hiss sound effect and smoke particles. (This sets the Solar and Small Coal Boilers to 12000\/16000L, and the High Pressure boilers to 24000\/32000L.)<br \/>\nIn High Pressure Boilers: 1 point of Heat is still lost every 45 ticks. 1 point of Fuel is still burned every 12 ticks. However, the fuel values in the High Pressure Coal Boiler are HALF of the fuel values used by the Small Coal Boiler. (Lignite = 20 Fuel ticks, Char\/Coal = 80, Coke = 320 although these may need to be changed because Railcraft cut Coal and Coal Coke fuel values in half back in 8.3.0.0, when the Boiler math was rewritten.)","replies":[{"user":"PaladinOne","created":"2014-05-24T14:52:35-07:00","body":"I spent a little time last night trying to figure out how to get decompiled IC2\/GT.  I was not having much luck, probably because even though I can read code and translate it to English, I have no idea how to set up a workspace."},{"user":"Reloque","created":"2014-05-24T14:53:32-07:00","body":"I suppose, you could just open the .zip with JD-Gui."},{"user":"PaladinOne","created":"2014-05-24T14:55:18-07:00","body":"The math for what happens when you pipe Lava into a Boiler looked incredibly weird; I've asked Greg for clarification and I'm hoping he answers."},{"user":"PaladinOne","created":"2014-05-24T15:08:55-07:00","body":"Ok, thanks for the JD-GUI tip.  I've re-read it and here's my conclusions:<br \/>\n<br \/>\nIf ProcessingEnergy &lt; 50, and Lava is attempting to be piped in,<br \/>\nTake the amount of lava piped in, and 50, and choose the smaller.  That is how much Lava is piped in.  Then add this to the current ProcessingEnergy.<br \/>\n<br \/>\nShort form:<br \/>\nIf the Lava Boiler contains less than 50L of Lava, it allows up to 50L of Lava to be piped into it. So its internal Lava storage can be between 50 and 100L, or 1000L if you use Buckets."},{"user":"Reloque","created":"2014-05-24T15:18:38-07:00","body":"Every time you write L, I think Long. That's why I write milliBuckets. But I don't know which is correct. It is important to note, the Lava Boiler doesn't really have a lava storage. It converts lava straight into energy (GregoriusT taking a shortcut). And the energy after piping lava is between 50L - 99L. This limit is ignored when manually placing buckets."},{"user":"PaladinOne","created":"2014-05-24T15:28:40-07:00","body":"Right.  Greg explicitly uses Litres as his fluid measurement system so that what I try to use whenever I'm talking GregTech math.  (1L = 1mB)  And yeah that's a shortcut Greg used for some of the generators back in 1.6, if you used Cells or Fuel Cans to add fuel as opposed to piping fluid fuels in.<br \/>\n<br \/>\nThis is the first time he's used that shortcut for piped in fluid fuel though."},{"user":"PaladinOne","created":"2014-05-24T15:33:39-07:00","body":"For that matter, it's also the shortcut used in the (fluid) Naquadah Generator.  Give it an Enriched Naquadah Cell, and it gives you a Naquadah Cell, and gives itself ~9M(?) EU of fuel to burn through and output.  No fluid is stored."},{"user":"Reloque","created":"2014-05-24T15:41:49-07:00","body":"In GT_LiquidAndFuelLoader.class: 200,000EU"},{"user":"PaladinOne","created":"2014-05-24T16:05:43-07:00","body":"It was some really really big amount of energy, and that's probably the fuel value per L (mB).  I'm pretty sure the Naquadah Generator got a LOT more EU stored from 1 cell.<br \/>\n<br \/>\nI looked at that .class file, and yeah it's 200,000EU per 1L, so 200,000,000EU per Cell.<br \/>\n... Damn that's a lot of energy.  Naquadah is valuable stuff."},{"user":"Reloque","created":"2014-05-24T16:44:29-07:00","body":"&quot;-All Steel (High-Pressure) Steam Machines store 32,000L (32 Buckets) of Steam in their internal tanks. However, bug, the Debug Scanner displays that Tank 0 has a capacity of 16,000. (Should be 32,000)&quot;<br \/>\n<br \/>\nAt least the Steel furnace has only 16000."},{"user":"PaladinOne","created":"2014-05-24T19:04:05-07:00","body":"That is correct.  The 32,000 value only applies to the two High Pressure Boilers.  All steam machines, bronze or steel, store 16,000L Steam."},{"user":"PaladinOne","created":"2014-05-24T19:04:50-07:00","body":"by &quot;that is correct&quot; i mean your comment about the Steel furnace.  My OP was slightly incorrect."},{"user":"PaladinOne","created":"2014-05-23T00:06:27-07:00","body":"Steam Machine math:<br \/>\n-All Steam Machines (Bronze and High-Pressure\/Steel) can store 16 Buckets of Steam internally. This is enough for all of them to run at least 1 process.<br \/>\n-The Steam Furnace takes 256 ticks to smelt an item, at 4L Steam\/tick, for a total of 1024 Steam\/item<br \/>\n-The Steam Powered Forge Hammer take 112 ticks to hammer a pair of Iron Ingots into an Iron Plate, at 16 Steam\/tick, for a total of 1792 Steam\/Plate ALTHOUGH this number may be based on the ingot you're trying to smash.<br \/>\n-The Steam Extractor takes 800 ticks to extract a Sticky Resin into 3 Rubber Pulp, at 2 Steam\/tick for a total of 1600 Steam\/item<br \/>\n-The Steam Compressor also takes 800 ticks at 2 Steam\/tick for a total of 1600 Steam\/item<br \/>\n-The Steam Macerator also takes 800 ticks at 2 Steam\/tick for a total of 1600 Steam\/item or Ore block. However, the GUI of the Steam Macerator shows only 1 output slot, while the GUI Of the High Pressure Macerators shows 2 output slots, implying by-products are possible. [Unknown if they are.]  Also, very importantly, the Steam Macerator DOES DOUBLE ORES, unlike the Sturdy Grinder in 1.6. One block of Ore macerates into 2 Crushed Ores.<br \/>\n-The Steam Alloy Smelter takes 400 ticks at 16 Steam\/tick for a total of 6400 Steam\/item set. This makes it by far the most Steam-intensive machine to operate.<br \/>\n<br \/>\nCompressed\/Rephrased:<br \/>\n-The Steam Furnace takes 4 Steam\/t but takes the least total Steam of any machine per operation<br \/>\n-The Steam Forge Hammer and Steam Alloy Smelter both consume the most Steam\/tick at 16 Steam\/t each. The Steam Alloy Smelter consumes the most Steam of any machine.<br \/>\n-The Steam Compressor, Macerator, and Extractor all take the longest time to process, but only 2 Steam\/t each.<br \/>\n<br \/>\n-High Pressure Steam Machines are twice as fast as Bronze Steam Machines, but consume Steam 3 times as quickly and consume 50% more Steam per item processed."},{"user":"Reloque","created":"2014-05-24T13:44:18-07:00","body":"Bronze Boiler for 1.7.2<br \/>\n<!-- ws:start:WikiTextHeadingRule:0:&lt;h6&gt; --><h6 id=\"toc0\"><a name=\"x-----===========\"><\/a><!-- ws:end:WikiTextHeadingRule:0 -->===========<\/h6>\nEvery Tick:<br \/>\n<hr \/>\n-Has a capacity of 16 buckets.<br \/>\n-If mTemperature is less than 20, it is set to 20 and the mLossTimer is set to 0.<br \/>\n-The mLossTimer is incremented every tick.<br \/>\n-Every 2.25 seconds (45 ticks) the mTemperature decrements, and the mLossTimer is set to 0.<br \/>\n-Steam is output to all sides except the front, up to 1 bucket of steam per side per tick. [what order? needs testing]<br \/>\n-Every 1.25 seconds (25 ticks) the Boiler attempts to produce steam.<br \/>\n    -If the temperature is greater than 100, and the internal fluid tank (mFluid) is not filled with water, nothing happens. The mHadNoWater flag is set to true.<br \/>\n    -If the above statement was not executed this tick, but the mHadNoWater flag is true, that means water was put into the machine after it reached a temperature of 100, and the machine explodes.<br \/>\n    -Otherwise, the internal fluid tank (of water: mFluid) is decremented (by one mB), the internal steam tank is incremented by 150mB of steam.<br \/>\n    -If the temperature is less than or equal to 100, it is safe to put water in the machine because the mHadNoWater flag is set to false.<br \/>\n-If the internal steam tank is greater than 16 buckets, you hear a sound and the tank goes down to 12 buckets!<br \/>\n-The machine deals with input: If the machine's mProcessingEnergy is less than or equal to 0; and if the machine is allowed to work and the input slot is not empty, it checks what kind of item is in the inventory slot. For the following items it increases the mProcessingEnergy time by the amount shown below.<br \/>\n<br \/>\n<br \/>\n    Item        ProcessingEnergy    dustTiny Ashes Chance<br \/>\n    Coal        160            25% Dark Ash<br \/>\n    Charcoal    160            25% Ash<br \/>\n    &quot;fuelCoke&quot;    640            33.33% Ash<br \/>\n    Lignite        40            11.11% Dark Ash<br \/>\n<br \/>\n-The penultimate routine is the conversion of energy to heat. Every 3\/5 of a second (12 ticks) the Boiler attempts to increase its mTemperature and decrease its mProcessingEnergy. This only occurs when the mTemperature is less than 500, and the mProcessingEnergy is greater than 0.<br \/>\n<br \/>\nSteel Boiler for 1.7.2<br \/>\n<!-- ws:start:WikiTextHeadingRule:2:&lt;h6&gt; --><h6 id=\"toc1\"><a name=\"x-----==========\"><\/a><!-- ws:end:WikiTextHeadingRule:2 -->==========<\/h6>\nEvery Tick:<br \/>\n<hr \/>\n-Has a capacity of 32 buckets.<br \/>\n-If mTemperature is less than 20, it is set to 20 and the mLossTimer is set to 0.<br \/>\n-The mLossTimer is incremented every tick.<br \/>\n-Every 2 seconds (40 ticks) the mTemperature decrements, and the mLossTimer is set to 0.<br \/>\n-Steam is output to all sides except the front, up to 1 bucket of steam per side per tick.<br \/>\n-Every 0.5 seconds (10 ticks) the Boiler attempts to produce steam.<br \/>\n    -If the temperature is greater than 100, and the internal fluid tank (mFluid) is not filled with water, nothing happens. The mHadNoWater flag is set to true.<br \/>\n    -If the above statement was not executed this tick, but the mHadNoWater flag is true, that means water was put into the machine after it reached a temperature of 100, and the machine explodes.<br \/>\n    -Otherwise, the internal fluid tank (of water: mFluid) is decremented (by one mB), the internal steam tank is incremented by 150mb of steam.<br \/>\n    -If the temperature is less than or equal to 100, it is safe to put water in the machine because the mHadNoWater flag is set to false.<br \/>\n-If the internal steam tank is greater than 32 buckets, you hear a sound and the tank goes down to 24 buckets!<br \/>\n-The machine deals with input: If the machine's mProcessingEnergy is less than or equal to 0; and if the machine is allowed to work and the input slot is not empty, it checks what kind of item is in the inventory slot. For the following items it increases the mProcessingEnergy time by the amount shown below.<br \/>\n<br \/>\n    Item        ProcessingEnergy    dustTiny Ashes Chance<br \/>\n    Coal        160            25% Dark Ash<br \/>\n    Charcoal    160            25% Ash<br \/>\n    &quot;fuelCoke&quot;    640            33.33% Ash<br \/>\n    Lignite        40            11.11% Dark Ash<br \/>\n<br \/>\n-Every 3\/5 of a second (12 ticks) the Boiler attempts to increment its mTemperature and decrement its mProcessingEnergy *BY 2*. This only occurs when the mTemperature is less than 1000, and the mProcessingEnergy is greater than 0."},{"user":"PaladinOne","created":"2014-05-24T13:54:25-07:00","body":"So the High Pressure Coal Boiler produces steam 2.5x faster, at the cost of 2x the fuel?<br \/>\nExcellent, thank you once again for the actual numbers.  These numbers are also mostly consistent with the 1.6 numbers; the only difference is what happens when the internal tanks fills up."},{"user":"Reloque","created":"2014-05-24T14:25:41-07:00","body":"Here's info for the Lava Boiler, while you're feeling math-y.<br \/>\n<br \/>\n<br \/>\n<hr \/>\nLava Boiler for 1.7.2<br \/>\n<!-- ws:start:WikiTextHeadingRule:0:&lt;h6&gt; --><h6 id=\"toc0\"><a name=\"x-----=========\"><\/a><!-- ws:end:WikiTextHeadingRule:0 -->=========<\/h6>\n*Note, I (Reloque) haven't used one of these yet; this is all from the code*<br \/>\nDescription: &quot;A Boiler running off Lava&quot;<br \/>\nCapacity of 32000mB, or 32 buckets.<br \/>\nBase temperature of 20.<br \/>\n<br \/>\n<br \/>\n<br \/>\n<!-- ws:start:WikiTextHeadingRule:2:&lt;h5&gt; --><h5 id=\"toc1\"><a name=\"x----=\"><\/a><!-- ws:end:WikiTextHeadingRule:2 -->=<\/h5>\nEvery Tick:<br \/>\n<!-- ws:start:WikiTextHeadingRule:4:&lt;h5&gt; --><h5 id=\"toc2\"><a name=\"x----=\"><\/a><!-- ws:end:WikiTextHeadingRule:4 -->=<\/h5>\n-If the mTemperature is less than or equal to 20, it is set to 20 and mLossTimer is set to 0.<br \/>\n-The mLossTimer is incremented. If it is more than 20, the mTemperature is decremented and the mLossTimer is set to 0.<br \/>\n-The Boiler attempts output steam to each side except the front. max of 1 bucket per side per tick. [There is an order, but I don't know what it is].<br \/>\n-Every 0.5 seconds (10 ticks),<br \/>\n    -If the temperature is higher than 100<br \/>\n        -If the water tank is devoid of water, the mHadNoWater flag is set to true.<br \/>\n        -Otherwise<br \/>\n            -if the mHadNoWater flag is true, it explodes because you added water after it was hot<br \/>\n            -The mFluid amount is decremented (by 1 mB)<br \/>\n            -The steam tank is increased by 300mB<br \/>\n    -If the temperature is less than or equal to 100, mHadNoWater is set to false<br \/>\n-If the steam tank has more than 32 buckets of steam, a sound is played and the tank is reduced to 24 buckets!<br \/>\n-If the mProcessingEnergy is less than or equal to 0 AND there is lava bucket in the input slot, the mProcessingEnergy is increased by 1000, the lava bucket disappears, and an empty bucket is put in the output slot<br \/>\n-Every 0.4 seconds, if mTemperature is less than 1000 AND the mProcessingEneergy is less than 0, mProcessingEnergy is decremented by Two and mTemperature is incremented by 1.<br \/>\n<br \/>\n<br \/>\n<br \/>\n<!-- ws:start:WikiTextHeadingRule:6:&lt;h6&gt; --><h6 id=\"toc3\"><a name=\"x----=-==================================================================\"><\/a><!-- ws:end:WikiTextHeadingRule:6 -->==================================================================<\/h6>\nWhen you try to pipe to the machine with a fluid (Not every tick, new section)<br \/>\n<!-- ws:start:WikiTextHeadingRule:8:&lt;h6&gt; --><h6 id=\"toc4\"><a name=\"x----=-==================================================================\"><\/a><!-- ws:end:WikiTextHeadingRule:8 -->==================================================================<\/h6>\n-If the fluid is lava AND the mProcessingEnergy is less than 50, the mProcessingEnergy is set to the mProcessingEnergy plus [the smaller of 50 and the mBs piped in that tick]. It then returns [the smaller of 50 and the mBs piped in that tick]. In essence this means the Boiler bottlenecks lava piped in to 50mB\/t. Anything more efficient is wasting lava :S<br \/>\n-If the fluid is not lava, it goes to default MetaTileEntity fill behavior (see below).<br \/>\n<br \/>\n<hr \/>\nWhen you try to pipe any Gregtech MetaTileEntity (without its own custom overwrites) with a fluid:<br \/>\n<!-- ws:start:WikiTextHeadingRule:10:&lt;h6&gt; --><h6 id=\"toc5\"><a name=\"x----=-======================================================================================\"><\/a><!-- ws:end:WikiTextHeadingRule:10 -->======================================================================================<\/h6>\n-If this MetaTileEntity has a steamEngineUpgrade AND the fluid being filled is steam AND the fluid amount is greater than 1mB,<br \/>\n    -local variable tSteam is assigned: [the smaller of 2,147,483,647 and [the smaller of (the Fluid.amount being piped in \/ 2) and (the MetaTileEntity's steam capacity - the MetaTileEntity's stored steam)].<br \/>\n    -the MetaTileEntity's steam is increased by tSteam. (the funciton returns tSteam * 2)<br \/>\n-Otherwise, nothing happens (the function returns 0)."},{"user":"Reloque","created":"2014-05-24T14:30:56-07:00","body":"Oof. CommunityWiki ate up my formatting with tabs. If you need any clarification on &quot;if&quot;s, ask."},{"user":"Reloque","created":"2014-05-24T14:32:26-07:00","body":"Here's a part of the LavaBoiler with more than one '-' instead of invisible whitespace.<br \/>\n<br \/>\n<!-- ws:start:WikiTextHeadingRule:0:&lt;h5&gt; --><h5 id=\"toc0\"><a name=\"x----=\"><\/a><!-- ws:end:WikiTextHeadingRule:0 -->=<\/h5>\nEvery Tick:<br \/>\n<!-- ws:start:WikiTextHeadingRule:2:&lt;h5&gt; --><h5 id=\"toc1\"><a name=\"x----=\"><\/a><!-- ws:end:WikiTextHeadingRule:2 -->=<\/h5>\n-If the mTemperature is less than or equal to 20, it is set to 20 and mLossTimer is set to 0.<br \/>\n-The mLossTimer is incremented. If it is more than 20, the mTemperature is decremented and the mLossTimer is set to 0.<br \/>\n-The Boiler attempts output steam to each side except the front. max of 1 bucket per side per tick. [There is an order, but I don't know what it is].<br \/>\n-Every 0.5 seconds (10 ticks),<br \/>\n    --If the temperature is higher than 100<br \/>\n        ---If the water tank is devoid of water, the mHadNoWater flag is set to true.<br \/>\n        ---Otherwise<br \/>\n            ----if the mHadNoWater flag is true, it explodes because you added water after it was hot<br \/>\n            ----The mFluid amount is decremented (by 1 mB)<br \/>\n            ----The steam tank is increased by 300mB<br \/>\n    --If the temperature is less than or equal to 100, mHadNoWater is set to false<br \/>\n-If the steam tank has more than 32 buckets of steam, a sound is played and the tank is reduced to 24 buckets!<br \/>\n-If the mProcessingEnergy is less than or equal to 0 AND there is lava bucket in the input slot, the mProcessingEnergy is increased by 1000, the lava bucket disappears, and an empty bucket is put in the output slot<br \/>\n-Every 0.4 seconds, if mTemperature is less than 1000 AND the mProcessingEneergy is less than 0, mProcessingEnergy is decremented by Two and mTemperature is incremented by 1."},{"user":"PaladinOne","created":"2014-05-24T14:38:58-07:00","body":"I did a little testing on the Lava Boiler when I was gathering information for the first post in this thread.  (The first 2 posts here are reposts from the GT forum thread.)<br \/>\nAlso, I've been reposting this to the GT forum thread, as soon as I figured out what it all meant.<br \/>\n<br \/>\nGood work on all this, this is the sort of information we really need on this wiki (because NOBODY ELSE HAS IT XD)"},{"user":"Reloque","created":"2014-05-24T14:39:13-07:00","body":"Here's above information, reformatted so it is less ambiguous about what happens every 2 seconds, etc.<br \/>\n<br \/>\nBronze Boiler for 1.7.2<br \/>\n<!-- ws:start:WikiTextHeadingRule:0:&lt;h5&gt; --><h5 id=\"toc0\"><a name=\"x----=\"><\/a><!-- ws:end:WikiTextHeadingRule:0 -->=<\/h5>\nEvery Tick:<br \/>\n-Has a capacity of 16 buckets.<br \/>\n-If mTemperature is less than 20, it is set to 20 and the mLossTimer is set to 0.<br \/>\n-The mLossTimer is incremented every tick.<br \/>\n-Every 2.25 seconds (45 ticks) the mTemperature decrements, and the mLossTimer is set to 0.<br \/>\n-Steam is output to all sides except the front, up to 1 bucket of steam per side per tick. [what order? needs testing]<br \/>\n-Every 1.25 seconds (25 ticks) the Boiler attempts to produce steam.<br \/>\n    --If the temperature is greater than 100<br \/>\n        ---If the internal fluid tank (mFluid) is not filled with water, nothing happens. The mHadNoWater flag is set to true.<br \/>\n        ---If the internal fluid tank (mFluid) IS filled with water, but the mHadNoWater flag is true, that means water was put into the machine after it reached a temperature of 100, and the machine explodes.<br \/>\n        ---Assuming the machine didn't explode, the internal fluid tank (of water: mFluid) is decremented (by one mB), the internal steam tank is incremented by 150mB of steam.<br \/>\n    --If the temperature is less than or equal to 100, it is safe to put water in the machine because the mHadNoWater flag is set to false.<br \/>\n-If the internal steam tank is greater than 16 buckets, you hear a sound and the tank goes down to 12 buckets!<br \/>\n-The machine deals with input: If the machine's mProcessingEnergy is less than or equal to 0; and if the machine is allowed to work and the input slot is not empty, it checks what kind of item is in the inventory slot. For the following items it increases the mProcessingEnergy time by the amount shown below.<br \/>\n<br \/>\n<br \/>\nItem ProcessingEnergy dustTiny Ashes Chance<br \/>\nCoal 160 25% Dark Ash<br \/>\nCharcoal 160 25% Ash<br \/>\n&quot;fuelCoke&quot; 640 33.33% Ash<br \/>\nLignite 40 11.11% Dark Ash<br \/>\n<br \/>\n-The penultimate routine is the conversion of energy to heat. Every 3\/5 of a second (12 ticks) the Boiler attempts to increase its mTemperature and decrease its mProcessingEnergy. This only occurs when the mTemperature is less than 500, and the mProcessingEnergy is greater than 0.<br \/>\n<br \/>\nSteel Boiler for 1.7.2<br \/>\n<!-- ws:start:WikiTextHeadingRule:2:&lt;h4&gt; --><h4 id=\"toc1\"><a name=\"x---==\"><\/a><!-- ws:end:WikiTextHeadingRule:2 -->==<\/h4>\nEvery Tick:<br \/>\n-Has a capacity of 32 buckets.<br \/>\n-If mTemperature is less than 20, it is set to 20 and the mLossTimer is set to 0.<br \/>\n-The mLossTimer is incremented every tick.<br \/>\n-Every 2 seconds (40 ticks) the mTemperature decrements, and the mLossTimer is set to 0.<br \/>\n-Steam is output to all sides except the front, up to 1 bucket of steam per side per tick.<br \/>\n-Every 0.5 seconds (10 ticks) the Boiler attempts to produce steam.<br \/>\n--If the temperature is greater than 100<br \/>\n---If the internal fluid tank (mFluid) is not filled with water, nothing happens. The mHadNoWater flag is set to true.<br \/>\n---If the internal fluid tank (mFluid) IS filled with water, but the mHadNoWater flag is true, that means water was put into the machine after it reached a temperature of 100, and the machine explodes.<br \/>\n---Assuming the machine didn't explode, the internal fluid tank (of water: mFluid) is decremented (by one mB), the internal steam tank is incremented by 150mb of steam.<br \/>\n--If the temperature is less than or equal to 100, it is safe to put water in the machine because the mHadNoWater flag is set to false.<br \/>\n-If the internal steam tank is greater than 32 buckets, you hear a sound and the tank goes down to 24 buckets!<br \/>\n-The machine deals with input: If the machine's mProcessingEnergy is less than or equal to 0; and if the machine is allowed to work and the input slot is not empty, it checks what kind of item is in the inventory slot. For the following items it increases the mProcessingEnergy time by the amount shown below.<br \/>\n<br \/>\nItem ProcessingEnergy dustTiny Ashes Chance<br \/>\nCoal 160 25% Dark Ash<br \/>\nCharcoal 160 25% Ash<br \/>\n&quot;fuelCoke&quot; 640 33.33% Ash<br \/>\nLignite 40 11.11% Dark Ash<br \/>\n<br \/>\n-Every 3\/5 of a second (12 ticks) the Boiler attempts to increment its mTemperature and decrement its mProcessingEnergy *BY 2*. This only occurs when the mTemperature is less than 1000, and the mProcessingEnergy is greater than 0."},{"user":"PaladinOne","created":"2014-05-24T14:43:19-07:00","body":"The burn time of 1 Lava Bucket I can confirm to be 200 seconds from my original testing."},{"user":"Reloque","created":"2014-05-24T14:43:58-07:00","body":"There's lots of jumping around GT, IC2, Forge, and Minecraft, but all my information is derived from Bytecode and decompiled bytecode."}]}