{"page":"Automatic IC² Machines","page_id":"156679302","share_type":"discussion","created":"2013-09-15T23:52:35-07:00","createdBy":"CurlyH","title":"Adding Recipes to IC2","description":"I see some, if not all, of the recipes for the machines are changed from vanilla IC2, shall we add them here?","replies":[{"user":"PaladinOne","created":"2013-09-16T00:31:44-07:00","body":"There aren't very many IC2 machine recipes actually changed; most are just overwritten with new machines.<br \/>\nAnd this is filed under the rather extensive &quot;Changed Recipes&quot; section."},{"user":"CurlyH","created":"2013-09-16T00:44:27-07:00","body":"Well, most machines seem to require plates and different hulls. Compare for example:<br \/>\n<br \/>\nCanning machine in IC2:<br \/>\n<br \/>\nCircuit<br \/>\nMachine Block<br \/>\n7 Tin Ingots<br \/>\n<br \/>\nto GT Recipe:<br \/>\n<br \/>\nCircuit<br \/>\n7 Tin Plates<br \/>\nSteel\/Stainless Steel Machine Hull<br \/>\n<br \/>\nThis is just an example, but the actual recipe for said Canning Machine is not anywhere in this wiki."},{"user":"PaladinOne","created":"2013-09-16T01:28:41-07:00","body":"Nothing involving Stainless Steel is properly documented yet.  However, unless I am mistaken, IC2 is going over to the standard of using Plates for a whole bunch of stuff, so that may be a non-issue soon."},{"user":"CurlyH","created":"2013-09-16T01:31:41-07:00","body":"Even if IC2 goes to plates (good piece of info there!) the machine blocks will still change.<br \/>\n<br \/>\nThe thing is, if SS is not well documented, shall we start documenting it? <br \/>\n<br \/>\nWhat do you suggest then, wait for, say, 10 days and then document?<br \/>\n<br \/>\nI've just started here, so don't want to step on the toes of anyone.<br \/>\n<br \/>\nThanks for the heads up.<br \/>\n<br \/>\nhanks for the heads up."},{"user":"PaladinOne","created":"2013-09-16T17:39:03-07:00","body":"If you want to start working on Stainless Steel, go for it.<br \/>\nThe Machine Block recipe change is documented (see Changed Recipes)"}]}