{"page":"Diesel Generator","page_id":"155377606","share_type":"discussion","created":"2013-09-17T01:14:30-07:00","createdBy":"CurlyH","title":"BC Piping Ethanol not firing the engine.","description":"The Diesel generator doesn't seem to kickstart on BC pipe ethanol feed, the fuel just keeps accumulating and doesn't produce energy.<br \/>\n<br \/>\nAfter pumping the fuel out (you can see the pipe is on the other direction now), and feeding it a can of ethanol\/coalfuel\/else, it works properly.<br \/>\n<br \/>\n<!-- ws:start:WikiTextUrlRule:6:http:\/\/i.imgur.com\/VD8gloA.png --><a class=\"wiki_link_ext\" href=\"http:\/\/i.imgur.com\/VD8gloA.png\" rel=\"nofollow\">http:\/\/i.imgur.com\/VD8gloA.png<\/a><!-- ws:end:WikiTextUrlRule:6 --><br \/>\n<br \/>\nWorth noting?","replies":[{"user":"PaladinOne","created":"2013-09-17T01:17:09-07:00","body":"What version is this on?"},{"user":"CurlyH","created":"2013-09-17T01:19:46-07:00","body":"4.03 d"},{"user":"PaladinOne","created":"2013-09-17T01:24:01-07:00","body":"And it works off of pumped ethanol after you've shoved a can of it in?"},{"user":"CurlyH","created":"2013-09-17T02:21:41-07:00","body":"Note the importance between CAN and CELL in this comment.<br \/>\n<br \/>\nWire Diesel Generator (DG) to empty out-of-grid MFE.<br \/>\n<br \/>\nTEST 1<br \/>\n- Put a can of biomass in the IN chamber of DG, loads liquid, doesn't start<br \/>\n- When liquid is loaded a coloured square will appear in the fuel tank of the DG.<br \/>\n- Put an empty can in the IN chamber of DG, unloads liquid into can.<br \/>\nTEST 2<br \/>\n- Put a can of ethanol in the IN chamber of DG, loads liquid, doesn't start<br \/>\n- Put an empty can in the IN chamber of DG, unloads ethanol into can.<br \/>\nTEST 3<br \/>\n- Put a can of ethanol in the IN chamber of DG, loads liquid, doesn't start<br \/>\n- Put an empty cell in the IN chamber of DG, doesn't load liquid.<br \/>\nTEST 4<br \/>\n- Pump Ethanol into DG. Liquid acumulates on bar, doesn't start.<br \/>\n- Put empty cans in the IN chamber of DG. Only drains in full sets of 1.000 mB. The odd amount is left in the DG.<br \/>\n- Wrench it out and replace it.<br \/>\n- Put ethanol CELL in the IN chamber of DG. Liquid amount doesn't change. DG starts, instead of an orange ethanol square in the fuel tank, an intermitent fire symbol appears.<br \/>\n- After outputting ~127.000 EU into the MFE, turns off.<br \/>\n- Pump ethanol in. Doesn't Start. Fuel counts: iquid amount 3.879 <br \/>\n- Drain the MFE.<br \/>\n- With ethanol in the fuel tank, put a fuel CELL in the IN Chamber of the DG. Starts.<br \/>\n- After outputting ~127.000 EU into the MFE, DG turns off. Fuel indicator still showing 3.879"},{"user":"CurlyH","created":"2013-09-17T02:22:18-07:00","body":"I simply don't seem able to put Forestry liquids into CELL."},{"user":"CurlyH","created":"2013-09-17T02:23:40-07:00","body":"Last test.<br \/>\nPut 3 cells of ethanol in IN chamber, Liquid amount still 3.879.<br \/>\nImmediatly one cell is emptied and put in OUT, DG starts churning EU. Liquid amount doesn't change.<br \/>\n<br \/>\nI think it doesn't work :·D"},{"user":"PaladinOne","created":"2013-09-17T02:51:45-07:00","body":"Report this on the main thread, this is buggy.  Might be a bit of inconsistency with Fluids."}]}