{"page":"Industrial Centrifuge","page_id":"155397582","share_type":"discussion","created":"2013-05-31T11:38:42-07:00","createdBy":"kenken244","title":"Direction of Page","description":"I think that we would be best off for machines like the centrifuge, electrolyzer, and assmebly machine, that have lots of recipes, to just show general information about the machine, and link to another page with a nice indexed list of recipes. would probably be best for readability.","replies":[{"user":"SpwnX","created":"2013-05-31T12:04:34-07:00","body":"Just make machine recipes on bottom of page, with everything else above it."},{"user":"kenken244","created":"2013-05-31T12:06:29-07:00","body":"that would not be as helpful as another page, with a proper indexed table of contents, and grouped together by type. we want to try to make this more useful than just flipping through recipes in NEI"},{"user":"SpwnX","created":"2013-05-31T12:11:28-07:00","body":"Well, the recipes can be indexed in the same page, below everything.<br \/>\nCreating new pages is not necessary.<br \/>\nAlso beware on edit conflicts, you are conflicting with &quot;ILoveGregTech&quot; causing each other to delete your edits."},{"user":"SpwnX","created":"2013-05-31T12:14:13-07:00","body":"Or you could make ONE page for ALL machinery recipes."},{"user":"SpwnX","created":"2013-05-31T12:15:05-07:00","body":"Which wouldnt be so good as one can get lost and not find the page.<br \/>\n<br \/>\nFor example if i would like to look for Industrial Electrolyzer recipes, i would look into its page, not somewhere else."},{"user":"kenken244","created":"2013-05-31T12:20:15-07:00","body":"Thinking about it, I do suppose it would be better to do that, provided that it is still sorted and indexed. I was worried that having a huge chart of recipes would get in the way of more important information, though I suppose that belief was somewhat unfounded.<br \/>\n<br \/>\nAnd ILGT, If you are going to do something like this again, please post about it on the discussion page beforehand, so we know what you are doing and why."},{"user":"SpwnX","created":"2013-05-31T12:21:41-07:00","body":"I've already written this on  IC²forum but writing again is not bad :<br \/>\nEach of you make a &quot;desktop&quot; page, so you can freely edit it without any problems. After you are done, copy-paste it on the original page."}]}