{"share_type":"discussion","created":"2013-12-25T12:30:42-08:00","createdBy":"okaolias","title":"Fluid pipes and buildcraft interaction","description":"I was a bit surprised when I saw the part about fluid pipe interaction, so I ran some tests and they didn't interact like item pipes after 4.06d. I already felt like a dick for just deleting part of choco's edit with a comment that ammounted to &quot;nope, yer wrong&quot;, and I hadn't really tested covers at the time, so I though I'd put my findings here before modifying the entry and see what other have to add.<br \/>\n<br \/>\nBuildcraft fluid pipes seem to recognise GT fluid pipes, probably as tanks, and will input fluids into them. GT fluid pipes by themselves don't seem to care about BC fluid pipes. Putting a pump cover on GT pipes set to export(the default mode when you slap them on) will let them export into BC pipes. However, they will no longer accept fluids, since covers set on import won't, well... export. I tried setting the covers to different modes but the one-way nateure remained.<br \/>\n<br \/>\nIt seemed weird that Greg would add fluid pipe interraction like this when item pipes would seamlessly work as parts of the same network. Testing version 4.05s that still was around in my recycle bin, this behaviour already existed. On hindsight, since pump covers existed before GT pipes were added, it makes sense that they can export into buildcraft pipes.<br \/>\n<br \/>\nIn conclusion, I think the part about GT and BC fluid pipes should be put seperately from the 4.06d changes to GT\/TE\/BC item transfer network integration and the one way nature of the resulting systems pointed out.","replies":[{"user":"okaolias","created":"2013-12-25T12:33:46-08:00","body":"Second paragraph, second to last sentence, I meant to say that covers set to export won't import, accidentaly wrote the oposite. I hope you'll excuse some other mistakes I totally failed to notice during proofreading..."},{"user":"Chocohead","created":"2013-12-25T14:41:29-08:00","body":"How about covers set to export allow import? Interesting what you've found though."},{"user":"okaolias","created":"2013-12-25T15:17:52-08:00","body":"It made sense that it would work since BC pipes passively input into GT pipes, and the active export would allow a two way interraction, but it didn't.<br \/>\n<br \/>\nIt looks like the dual modes were made for machines that export from different slots than they input to, even while using the same face. The bronze blast furnace automation is a good example, as the conveyors can only export into the coal and iron slots, but can only import from the steel slot.<br \/>\n<br \/>\nAs soon as the liquid gets passively imported into the GT pipe, it's actively exported back to the BC pipes. I also tested &quot;export, allow import&quot; for item pipes, and it acts exactly like that. It pushes the stack right back, as soon as it enters the pipe, effectively creating a one way shutter. A one way shutter that won't have items just spilling out of the BC pipes when they encounter the closed shutter. Hey, I think I stumbled upon something vaguely useful, if unrelated, along the way :D"}]}