{"page":"Contributor Talk","page_id":"155397924","share_type":"discussion","created":"2013-09-06T23:07:55-07:00","createdBy":"Qwertygiy","title":"Grammar Suggestions","description":"Hello all. Qwertygiy, infrequent modder and frequent modplayer here.<br \/>\n<br \/>\n[Now, before I begin, I make this disclaimer. I am not an English teacher. I have never even taken a proper class on English, as I've been homeschooled my whole life. But I read grammar textbooks, I frequent professionally-run websites, and I am an amateur novel writer.<br \/>\n<br \/>\nI also understand that GregoriusT lives in Germany and that English is not his native language, and that among other things the modern German language uses capital letters far more frequently than modern English does. This is not meant to accuse him or anyone else of awful penmanship. I admit that I can't read more than a couple dozen words of any other given language.<br \/>\n<br \/>\nBut I think I've got this English stuff down pretty well.]<br \/>\n<br \/>\nI've noticed that there are some inconsistencies and incorrectness in some wiki articles, and I'd like to try to provide a set of guidelines that people can agree to follow. I'll try to stick to rules and precedents provided by other wikis, particularly Wikipedia and MinecraftWiki.<br \/>\n<br \/>\nFirst, capitalization. In English, only proper nouns and the beginnings of sentences should be capitalized. This is not a Proper Noun. But Bob is. However, in Minecraft, you have items that make it hard to tell whether they are proper nouns or not. Take &quot;ingots&quot;. Ingots is not a proper noun. I have some ingots of metal. I have some ingots of iron. That's how you would say it when referring to real life.<br \/>\n<br \/>\nHowever, in Minecraft, we have Iron Ingots. Yes, I have a stack of Iron Ingots in my base. I used some to make a Compass so I could find my Diamond Blocks.<br \/>\n<br \/>\nThe rule I'd like to propose, that I believe the Minecraft Wiki already has in effect, is: <strong>If you're using the full name of a specific item, such as Iron Ingot or Iron Block or Macerator, capitalize it. <em>If you are not using the full name, or you are using a verb, such as iron or ingot or block or macerate, do not capitalize it.<\/em><\/strong><br \/>\n<br \/>\nThe second rule I'd like to propose, has to do with sentence style. There's a difference between a conversation on a forum and a legal paper. Obviously I don't want the wiki to be as hard to read as a lawsuit, or even some Wikipedia articles, but I want it to <strong>be more formal and factual<\/strong>, like the Thermal Expansion or Railcraft wikis, <strong>than informal, although some humorous sections<\/strong> like in the IC2 and Forestry wikis <strong>might be wanted.<\/strong><br \/>\n<br \/>\nIf anyone has any objections, suggestions, corrections, or so on, please, say so. We're discussing how to better communicate, after all. It would be dumb and ironic to fail to express our ideas about how to express our ideas.","replies":[]}