{"share_type":"discussion","created":"2014-01-19T07:47:18-08:00","createdBy":"mr10movie","title":"Greg's material list (","description":"Maybe we could have a page listing all of the items on Greg's material list, and then we could link each one onto a page for uses for that item (would take a while, but it would be worth it).","replies":[{"user":"Chocohead","created":"2014-01-19T09:39:40-08:00","body":"Sounds good, but I'm not putting the million types there are now into one list :P"},{"user":"Chocohead","created":"2014-01-19T10:33:08-08:00","body":"EDIT I was wrong, turns out Greg's debug lists it for us :)"},{"user":"mr10movie","created":"2014-01-19T12:15:20-08:00","body":"How? I tried to find the list, but I couldn't see it with debug or debug2 on. Must be missing something."},{"user":"mr10movie","created":"2014-01-19T13:13:14-08:00","body":"Nevermind, I saw you added the page."},{"user":"Chocohead","created":"2014-01-19T13:21:16-08:00","body":"I added the list, but it still needs refining. It's in no logical order at all"},{"user":"mr10movie","created":"2014-01-19T13:22:58-08:00","body":"Maybe a metal\/nonmetal\/gas\/other grid, with pictures of the ingots (or other defining item) by each one?"},{"user":"Chocohead","created":"2014-01-20T10:25:37-08:00","body":"Maybe. Would probably work better than a periodic table design."},{"user":"mr10movie","created":"2014-01-20T15:13:17-08:00","body":"I have an idea. If we do it as a periodic table, with one that is the regular periodic table, something similar for alloys, and something else for custom. Or are those last 2 too broad?"},{"user":"Chocohead","created":"2014-01-21T09:15:27-08:00","body":"Could work. Not sure what order the last two would go in though. Periodic and alloy tables make sense. Everything else should be a list IMO."},{"user":"mr10movie","created":"2014-01-21T10:57:32-08:00","body":"I made the periodic table. Pictures will follow (at some point). Should we keep it in this layout, or should we remove all of the elements that don't exist in GT, and have the ones that are in GT in a regular table?"},{"user":"Chocohead","created":"2014-01-21T11:16:51-08:00","body":"Yeah, one's not in Gregtech over complicate it and should be removed. The layout is nice :)"}]}