{"page":"Contributor Talk","page_id":"155397924","share_type":"discussion","created":"2013-09-06T17:08:13-07:00","createdBy":"Qwertygiy","title":"My first page: Am I doing this right?","description":"Hey everyone,<br \/>\n<br \/>\nI spent a couple of hours today getting used to Wikispaces again (the other two Wikispaces that I am members of are Inficraft and Equivalent Exchange, so that should tell you how long it's been) and created the <a class=\"wiki_link\" href=\"\/Lathe\">Lathe<\/a> page. I plan on doing more machines like this, as well as item pages for things like rods and gears and so on. I also plan on adding more recipe templates like the current crafting recipe ones for machines, because I understand how image maps work and I have NEI to copy template GUIs from :) I checked other pages to base my page off of; I just wanted to make sure I'm doing this right so far.<br \/>\n<br \/>\nThanks for helping a fellow mod fanatic make this wiki a better place!","replies":[{"user":"PaladinOne","created":"2013-09-06T21:33:38-07:00","body":"Though I would ordinarily say &quot;KILL IT WITH FIRE!&quot; for your work on Equivalent Exchange, I really like where this is going so far.<br \/>\nI like adding links to other pages (such as, when Upgrades are mentioned in a heading, I like to link that back to the Upgrades page).  But, you have the recipe widget down, and that's a big thing to go on.  Welcome aboard."},{"user":"Qwertygiy","created":"2013-09-06T22:35:47-07:00","body":"Thanks :) I know, adding links is one thing I haven't started much on yet... but, there isn't a ton to link to yet. For such a big mod, GregTech has such a sadly incomplete wiki. Nearly two updates to the mod every day may be daunting, but we can do better than a massive Grammaticly Frustrating changelog plus NEI. :)<br \/>\n<br \/>\n(Also, although I have made an add-on mod for InfiCraft's far more balanced successor Tinker's Construct, I can't remember a single edit I made to either of those wikis. (shrugs) I've always been more of a MCW and MCF guy, I guess. And yes, haha, most people who like GregTech probably despise EE2. They're about as opposite balance-wise as is possible without ruining all fun gameplay.)"},{"user":"PaladinOne","created":"2013-09-07T00:59:35-07:00","body":"(Oh, the wonderful Tinker's Construct?  Even better, the mod that decided to ignore reason and make not merely one but two really stupid balance or game-breaking coding decisions, both of which involved declarations of war with Greg.)<br \/>\n<br \/>\nThe Changelog itself is all Word of Greg, and I actually find its grammatical frustrations and run-ons somewhat amusing.  However yes, GregTech is probably the worst documented major mod out there, likely in part because it is a one-man development team and thus there is nobody official to do these sorts of write-ups.<br \/>\nSlightly inconveniently though, you are only the 4th person I can remember seeing actively writing for pages this month.  (The others being myself, Malevolence, and SpwnX.)  I spent about 4 hours today writing a chunk of the Config Guide pages (which might be the most important but tedious pages we have to write).  (Seriously, those Config files are full of random things, and so many people have no damn clue what any of it means.)"},{"user":"Qwertygiy","created":"2013-09-07T06:06:57-07:00","body":"(Yes, sadly, Greg is like LexMenos and Eloraam in that he is an absolutely brilliant coder -- who is not blessed in the way of &quot;people skills&quot;. You come to him with an argument that he thinks isn't thought out very well, you're likely as not going to get a self-righteous F-bomb along with your comeuppance, the same as with Lex. And people like mDiyo and SirSengir don't appreciate that, and their rift widens.)<br \/>\n<br \/>\nYes, I've noticed that there's very few people signed up on this wiki. I spent about a month playing DivineRPG (by itself, of course; its weapons and mobs COMPLETELY overpower any other sense of balance in Minecraft... and as for tech, forget it, they can't even build a custom chest or furnace properly) and its wiki was the same way at the time. Of course, after I spent days formatting their wiki and deleting their spambots, they decided to take over half a year to update from 1.4.7... At least we know GregTech will constantly be updated with newer and better (opinions varying on &quot;better&quot;) things for us to extend the lives of our Minecraft worlds with."}]}