{"page":"Contributor Talk","page_id":"155397924","share_type":"discussion","created":"2013-09-07T19:23:00-07:00","createdBy":"PaladinOne","title":"New pages","description":"Particularly with all the things being added to GregTech over the last few weeks, I feel there should be a list of new pages that need to be created to compensate.<br \/>\n<br \/>\nThings I can think of right now:<br \/>\n-Bronze Age Machines (General page, individual pages, and possibly another tab on the left-side main menu)<br \/>\n-Pipes<br \/>\n-Gears<br \/>\n-Multiblock Machines (General page, including Machine Casings)<br \/>\n-a Main Pages tab on the left-side menu (basically a copy of the list from the Home Page)<br \/>\n-Machine Coloration<br \/>\n-more when either i or someone else thinks of them","replies":[{"user":"PaladinOne","created":"2013-09-07T21:19:14-07:00","body":"-the Materials section should probably just be changed to a single page"},{"user":"Qwertygiy","created":"2013-09-07T21:21:44-07:00","body":"I'll be working on Plates and Rods and Gears after I finish on the Tools, if I don't rapidly lose interest like I sometimes do over some things. Then I'll probably work on the Bronze Age machines, then other things."},{"user":"LinusPhoenix","created":"2013-11-05T22:32:48-08:00","body":"The fluid pipes aren't listened currently are they?"},{"user":"LinusPhoenix","created":"2013-11-05T22:35:02-08:00","body":"And the Bronze Blast Furnace, the most important of all bronze age machines, is not even listed in the Bronze Age Section."},{"user":"SpwnX","created":"2013-11-06T02:01:26-08:00","body":"Well, we are really lacking documentation as you can see... and no the fluid pipes are not documented yet."},{"user":"PaladinOne","created":"2013-11-10T02:19:56-08:00","body":"Just a thought, mostly to get immibis to stfu:<br \/>\n-tab on the side, specifically for Bronze\/Steam machines"},{"user":"SpwnX","created":"2013-11-10T06:58:00-08:00","body":"Done, now remember to tag them properly."}]}