{"share_type":"discussion","created":"2014-01-10T16:30:22-08:00","createdBy":"Chocohead","title":"Red + Yellow Garnets","description":"Is it worth me making a page for them and all the silly named dusts they can make? I mean on the electrolyzer page there is the recipes for processing the silly dusts but an exclusive page to see all of them at once would be better, right?","replies":[{"user":"PaladinOne","created":"2014-01-11T19:43:30-08:00","body":"That would probably be worthwhile, listing the uses for the Garnets.  They're rather odd materials, even by GregTech complexity standards."},{"user":"okaolias","created":"2014-01-12T08:29:12-08:00","body":"Maybe add a gems page? Red and Yellow Garnets are pretty unique in their weirdness, but they also have enough commonalities with the other gems. You could add a subsection dedicated to them in that page, but I don't know if it's worth it to have one just for them."},{"user":"mr10movie","created":"2014-01-12T08:45:49-08:00","body":"Do we have a subdirectory for materials? I know we have ores, but nothing on materials like ingots and gems. Perhaps we make something like that, a page for all of the materials (ingots, dusts, gems). They could be grouped, so iron dusts with iron ingots for example."},{"user":"Chocohead","created":"2014-01-12T09:24:32-08:00","body":"Gems yes, but have you seen how many dusts there are? Materials is a good idea in theory, but in practice it could take a VERY long time to make."},{"user":"mr10movie","created":"2014-01-12T09:30:56-08:00","body":"A lot of dusts are just ground ingots, and the rest shouldn't take TOO long...<br \/>\nJust slap a WIP on it :P"},{"user":"PaladinOne","created":"2014-01-12T11:35:41-08:00","body":"Sort of like my Config Guide page... that I started 6 months ago and never finished... :P"},{"user":"Chocohead","created":"2014-01-12T12:08:54-08:00","body":"The config guide was always next on my fix the page list, but the list kept growing since someone kept adding new things."},{"user":"SpwnX","created":"2014-01-14T11:14:39-08:00","body":"I think that a materials list should be good. I think that subdividing by Element is best.<br \/>\nHydrogen, Helium, Lithium, Berylium, Carbon, Nitrogen, Oxygen, Fluorine, Sodium, Magnesium, Aluminium, Silicon, Phosphorus, Sulfur, Chlorine, Potassium, Calcium, Titanium...<br \/>\n<br \/>\nEvery element page has information around it... like sources, uses and chemical compounds that has it (gems, alloys, useful substances)"},{"user":"mr10movie","created":"2014-01-14T12:52:32-08:00","body":"I was thinking less a page for each, and more just one page. Easier navigation on the sidebar. We could do multiple pages though."},{"user":"PaladinOne","created":"2014-01-14T13:50:09-08:00","body":"Landing page for all materials with links to pages for each material?<br \/>\n(That's actually something I wanted to have for the Bronze age Steam machinery, since there are some rules that all of them follow.)"},{"user":"Chocohead","created":"2014-01-15T07:52:39-08:00","body":"How about a periodic table layout for the elements :P"}]}