{"share_type":"discussion","created":"2014-01-28T20:20:46-08:00","createdBy":"CarbonBasedGhost","title":"Redo the wiki a bit","description":"I know a lot of people will be against this but I think this wiki needs to have a makeover. It is not a good source of information because there is a lot of outdated stuff on here. Just the other day I was reading an article on ores and it told me sheldonite still spawns in the end.<br \/>\n<br \/>\nWe should make a wholenew section for Gregtech 1.4.7 - 1.5.2 which most of the wiki's articles consist of and take start doing a 1.6.4 wiki. I reccomend taking the new articles and modifying the old articles for this 1.6.4 wiki. <br \/>\n<br \/>\nI don't want t document gregtech on a unorderly wiki.","replies":[{"user":"Raumis","created":"2014-01-28T20:39:05-08:00","body":"Sheldonite does spawn in the end and also in granite."},{"user":"Raumis","created":"2014-01-28T20:40:06-08:00","body":"I think this wiki should be updated to the latest content, I do not want to have another wiki created for legacy content."},{"user":"PaladinOne","created":"2014-01-30T00:36:21-08:00","body":"Every time I get my hands on a page that has egregiously outdated information, I spend like 6 hours rewriting pages.  And the Ores page does say that Sheldonite can spawn in Black Granite (just not explicitly in the Sheldonite section) as well as the End."},{"user":"TheN1K0L4Z","created":"2014-01-30T05:29:44-08:00","body":"Actually, a legacy segment wouldn't be such a bad idea, imho. Some players are still in denial about RP2's lack of updates. Since the 1.5.2 vanilla update, eloraam must be struggling to reiterate her code, she's probably quit on us.<br \/>\n<br \/>\nI'd rather have documentation for legacy builds, since the latest version of Gregtech is rather buggy, especially when it's using a dev version of IC2.<br \/>\n<br \/>\nPal, I can do backtracking via Feed The Beast wikis. So, if you need someone to write the legacy segment for 1.4.7, I'll be happy to. Now, I just need approval from the staff before I can get started on this wayback project. Plus, I'll also be cycling between this and a new FTB Ultimate Renaissance project involving an influence."},{"user":"Raumis","created":"2014-01-30T22:18:59-08:00","body":"I think a legacy section would be a great idea.  That way we can keep the main pages updated to what the latest release reflects."},{"user":"SpwnX","created":"2014-02-01T05:09:09-08:00","body":"If you guys want to make legacy pages, i'm not gonna stop you, but make sure they are linked only in the original (up to date) page with a link. : &quot;Information for this machine on MC 1.4.7 - MC 1.5.2&quot;.<br \/>\n<br \/>\nIf too many &quot;legacy&quot; pages are created, i will edit some parts of the wiki to make them more accessible through the main page."}]}